Tekla Open API Reference for Tekla Structures 2025
DotAnalysisModelObjectOperation Structure
 The serialization structure for analysis model object operations.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct DotAnalysisModelObjectOperation
<SerializableAttribute>
Public Structure DotAnalysisModelObjectOperation
See Also
Reference
Tekla.Structures.Analysis Namespace